<?php
//-------------------------Определяем директорию в которой лежит скрипт-----------------
$Site_Name="";
//--------------------------Подключаем библиотеки---------------------------------------
require_once($_SERVER['DOCUMENT_ROOT'].$Site_Name.'/library/db/db.php');
require_once($_SERVER['DOCUMENT_ROOT'].$Site_Name.'/library/auth/auth.php');

//-------------------------Блок авторизации---------------------------------------------
if ((getPrivelegies(0,@$_SESSION['logged_status'])!=1)){		
	header("Location:../../index.php");
}
//--------------------------Подключаем Smarty-----------------------------------------

//----------------------------------Подключаем хидер--------------------------------------
$id=$_GET['id'];

if (getNumRow('user')>1){
	$data=array('id'=>$id);
	deleteAllRow('user',$data);
}
header("location:panelUser.php");
//----------------------------------Подключаем мейн--------------------------------------

//----------------------------------Подключаем футер--------------------------------------

?>