<?php
/*
 * Скрипт осуществляет выход пользователя из системы
 */
//-------------------------Определяем директорию в которой лежит скрипт-----------------
$Site_Name="";
//---------------------------Подключаем библиотеки-------------------------------------
require_once($_SERVER['DOCUMENT_ROOT'].$Site_Name.'/library/db/db.php');
require_once($_SERVER['DOCUMENT_ROOT'].$Site_Name.'/library/auth/auth.php');
//----------------------------Выходим из системы---------------------------------------------
logOut();
//session_destroy();//посмотреть, вообще убивает всё и то что нада и что ненада
header("Location:../../index.php");
?>